# Series
ðŸŽ¯A one-dimensional array-like object containing a sequnce of values and associated array of data labels, called its index

In [1]:
import pandas as pd

In [2]:
obj = pd.Series([4,7,-5,3])
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [3]:
# Get the array representation and index object of the Series
obj.values

array([ 4,  7, -5,  3])

In [4]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [5]:
# Customize labels - index parameter
obj2 = pd.Series([4,7,-5,3], index = ['d','b','a','c'])
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [6]:
obj2.index

Index(['d', 'b', 'a', 'c'], dtype='object')

In [7]:
# Use labels in the indexing to get the single value or set of values
print(obj2['a'])

-5

In [8]:
print(obj2['d'])

4

In [9]:
print(obj2[['c','a','d']])

c    3
a   -5
d    4
dtype: int64

In [10]:
# Filtering with a boolean array
obj2[obj2 > 0]

d    4
b    7
c    3
dtype: int64

In [11]:
# Scalar multiplication
obj2 * 2

d     8
b    14
a   -10
c     6
dtype: int64

In [12]:
import numpy as np
np.exp(obj2)

d      54.598150
b    1096.633158
a       0.006738
c      20.085537
dtype: float64

In [13]:
# Mapping of indexing values to data values
'b' in obj2

True

In [14]:
'e' in obj2

False

In [15]:
# Convert Python dicttionary to Series
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}

In [16]:
obj3 = pd.Series(sdata)

In [17]:
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [18]:
# Overide the dict keys in the order we want then to appear
states = ['California','Ohio','Oregon','Texas']
obj4 = pd.Series(sdata, index = states)

In [19]:
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [20]:
# Missing or NA values detect
pd.isnull(obj4)

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [21]:
# Or
obj4.isnull()

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [22]:
pd.notnull(obj4)

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [23]:
# Or
obj4.notnull()

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [24]:
""" A useful Series feature for many applications is that it automatically
aligns by index label in arithmetic operations."""

obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [25]:
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [26]:
obj3 + obj4

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

In [27]:
# Both the Series object itself and its index have a name attribute

obj4.name = 'population'

In [28]:
obj4.index.name = 'state'

In [29]:
obj4

state
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

In [30]:
obj4.name

'population'

In [31]:
obj4.index.name

'state'

# DataFrame
ðŸŽ¯ðŸŽ¯A DataFrame represents a rectangular table of data and contains an ordered colection of columns, each of which can be a diiferent value type. It has both row and column index

In [32]:
# Construct a DataFrame from a dict of equal-length lists or NumPy arrays (common)
data = {'state': ['Ohio','Ohio','Ohio','Nevada','Nevada','Nevada'],
        'year': [2000,2001,2002,2001,2002,2003],
        'pop': [1.5, 1.7,3.6,2.4,2.9,3.2]
       }

frame = pd.DataFrame(data)

In [33]:
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [34]:
# For learge DataFrames, the head() method selects only the first five rows
frame.head()

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [35]:
# We can pass how many rows we want as parameters
frame.head(3)

  state  year  pop
0  Ohio  2000  1.5
1  Ohio  2001  1.7
2  Ohio  2002  3.6

In [36]:
# For learge DataFrames, the tail() method selects only the last five rows
frame.tail()

    state  year  pop
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [37]:
# We can pass how many rows we want as parameters
frame.tail(3)

    state  year  pop
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [38]:
# Manage sequence of columns according to custom order - using columns parameter
pd.DataFrame(data, columns = ['year','state','pop'])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

In [39]:
# If we pass a column that isn't contained in the dict, it will appear with missing values
frame2 = pd.DataFrame(data, columns = ['year','state','pop','debt'], index = ['one','two','three','four','five','six'])

In [40]:
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN
six    2003  Nevada  3.2  NaN

In [41]:
# Columns in the DataFrame
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [42]:
# Shape of the DataFrame
frame2.shape

(6, 4)

In [43]:
# Information about the DataFrame
frame2.info()

<class 'pandas.core.frame.DataFrame'>
Index: 6 entries, one to six
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   year    6 non-null      int64
 1   state   6 non-null      object
 2   pop     6 non-null      float64
 3   debt    0 non-null      object
dtypes: float64(1), int64(1), object(2)
memory usage: 240.0+ bytes

In [44]:
# Statistical summary
frame2.describe()

              year       pop
count     6.000000  6.000000
mean   2001.500000  2.550000
std       1.048809  0.836062
min    2000.000000  1.500000
25%    2001.000000  1.875000
50%    2001.500000  2.650000
75%    2002.000000  3.125000
max    2003.000000  3.600000

In [45]:
# Retrieved a column as a series - dict-like notation
frame2['state']

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
six      Nevada
Name: state, dtype: object

In [46]:
# Accessing like object atribute
frame2.year

one      2000
two      2001
three    2002
four     2001
five     2002
six      2003
Name: year, dtype: int64

In [47]:
# Rows can also be retrieved by position or name with the special loc attribute
frame2.loc['one']

year     2000
state    Ohio
pop       1.5
debt      NaN
Name: one, dtype: object

In [48]:
# Columns can be modified by assignment
frame2['debt'] = 16.5

In [49]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5  16.5
two    2001    Ohio  1.7  16.5
three  2002    Ohio  3.6  16.5
four   2001  Nevada  2.4  16.5
five   2002  Nevada  2.9  16.5
six    2003  Nevada  3.2  16.5

In [50]:
""" When assigning lists or assarys to a column, the values length must match the length of the DataFrame."""
frame2['debt'] = np.arange(6.)

In [51]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   0.0
two    2001    Ohio  1.7   1.0
three  2002    Ohio  3.6   2.0
four   2001  Nevada  2.4   3.0
five   2002  Nevada  2.9   4.0
six    2003  Nevada  3.2   5.0

In [52]:
# Assign valus to specific rows - using Series
values = pd.Series([-1.2,-1.5,-1.7], index = ['two','four','five'])

In [53]:
# If you assign a Series, its labels will be realigned exactly to the DataFrame's index. Inserting missing values in any holes
frame2['debt'] = values

In [54]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7
six    2003  Nevada  3.2   NaN

In [55]:
# Creatin a new column
frame2['eastern'] = frame2.state == 'Ohio'

In [56]:
frame2

       year   state  pop  debt  eastern
one    2000    Ohio  1.5   NaN     True
two    2001    Ohio  1.7  -1.2     True
three  2002    Ohio  3.6   NaN     True
four   2001  Nevada  2.4  -1.5    False
five   2002  Nevada  2.9  -1.7    False
six    2003  Nevada  3.2   NaN    False

In [57]:
# Delete method can be used to remove column
del frame2['eastern']

In [58]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [59]:
# DataFrame from dict of dicts
pop = {'Nevada':{2001:2.4, 2002:2.9}, 'Ohio':{2000: 1.5, 2001: 1.7, 2002: 3.6}}

In [60]:
# If the nested dict is passed to the DataFrame, pandas will interpret the outer dict kes as the columns and the inner keys as the row indices
frame3 = pd.DataFrame(pop)

In [61]:
frame3

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2000     NaN   1.5

In [62]:
# DataFrame can be transposed like NumPy array
frame3.T

        2001  2002  2000
Nevada   2.4   2.9   NaN
Ohio     1.7   3.6   1.5

In [63]:
pd.DataFrame(pop, index = [2000, 2001, 2002, 2003])

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6
2003     NaN   NaN

In [64]:
frame3.index

Index([2001, 2002, 2000], dtype='int64')

In [65]:
frame3.values
frame3

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2000     NaN   1.5

In [66]:
pdata = {'Ohio': frame3['Ohio'][:-1],
        'Nevada': frame3['Nevada'][:2]}

In [67]:
pd.DataFrame(pdata)

      Ohio  Nevada
2001   1.7     2.4
2002   3.6     2.9

In [68]:
# Set the DataFrame name, column name, and index name
frame3.name = 'population'
frame3.index.name = 'yaer'
frame3.columns.name = 'state'

In [69]:
frame3.name

'population'

In [70]:
frame3.index.name

'yaer'

In [71]:
frame3.columns.name

'state'

In [72]:
frame3

state  Nevada  Ohio
yaer
2001      2.4   1.7
2002      2.9   3.6
2000      NaN   1.5

In [73]:
# As with Series, the values attribute returns the data conatined in the DataFrame as a two-dimensional ndarray
frame3.values

array([[2.4, 1.7],
       [2.9, 3.6],
       [nan, 1.5]])

In [74]:
# If the DataFrame's columns are different dtypes, the dtype of the values array will be chosen to accommodate all of the the columns
frame2.values

array([[2000, 'Ohio', 1.5, nan],
       [2001, 'Ohio', 1.7, -1.2],
       [2002, 'Ohio', 3.6, nan],
       [2001, 'Nevada', 2.4, -1.5],
       [2002, 'Nevada', 2.9, -1.7],
       [2003, 'Nevada', 3.2, nan]], dtype=object)

# Index Objects
ðŸŽ¯Pandas's Index objects are responsible for holding the labels and other metadeta (like the axis name or names)

In [75]:
obj = pd.Series(range(3), index = ['a','b','c'])

In [76]:
index = obj.index

In [77]:
index

Index(['a', 'b', 'c'], dtype='object')

In [78]:
index[1:]

Index(['b', 'c'], dtype='object')

In [79]:
# Index objects are immutable and thus can not be modified by the user
index[1] = 'd'

TypeError: Index does not support mutable operations

In [ ]:
# Immutability makes it safer to share Index objects among data structure
labels = pd.Index(np.arange(3))

In [ ]:
labels

In [ ]:
obj2 = pd.Series([1.5, -2.5, 0], index = labels)

In [ ]:
obj2

In [ ]:
obj2.index is labels

In [ ]:
idx = pd.Index(['a','b','c'])

In [ ]:
s1 = pd.Series([1,2,3], index = idx)

In [ ]:
s2 = pd.Series([4,5,6], index = idx)

In [ ]:
# Both s1 and s share the same index object
s1.index is s2.index

In [ ]:
# An Index also behaves like a fixed-size set
frame3

In [ ]:
frame3.columns

In [ ]:
# Check if a column exists in the columns
'Nevada' in frame3.columns

In [ ]:
# Check if an index exists in the row labels/indices
2003 in frame3.index

In [ ]:
# Unlike Python sets, a pandas Index can contain duplicate labels
dup_labels = pd.Index(['foo', 'foo', 'bar', 'bar'])

In [ ]:
dup_labels

In [ ]:
# Selection with duplicate labels will select all the occurrence of that label
s = pd.Series([1,2,3,4], index = dup_labels)

In [ ]:
s.loc['foo']

# Essential Functionality

### Reindexing
ðŸŽ¯An important method on pandas objects is reindex, which means to create a new object with the data confirmed to a new index

In [ ]:
obj = pd.Series([4.5, 7.2, -5.3, 3.6], index = ['d', 'b','a', 'c'])

In [ ]:
obj

In [ ]:
# Calling reindex on this Series rearranges the data according to the new index, introducing missing values if any values were not already present
obj2 = obj.reindex(['a','b','c','d','e'])

In [ ]:
obj2

In [ ]:
# We can use the method parameter to fill the missing values automatically
obj3 = pd.Series(['blue','purple','yellow'], index = [0,2,4])

In [ ]:
obj3

In [ ]:
# method parameter can only be used when the index is ordered - meaning the index must have a clear order so Pandas knows what 'forward/backward' means
obj3.reindex(range(6), method = 'ffill')

In [ ]:
obj3.reindex(range(5), method = 'bfill')

In [ ]:
# With DataFrame, reindex can alter the (row) index, columns, or both. When passed only a sequence, it reindexes the rows in the result
frame = pd.DataFrame(np.arange(9).reshape(3,3), index = ['a','c','d'], columns = ['Ohio','Texas','California'])

In [ ]:
frame

In [ ]:
frame2 = frame.reindex(['a','b','c','d'])

In [ ]:
frame2

In [ ]:
# The columns can be reindexed with the columns keyword
states = ['Texas', 'Utah', 'California']

In [ ]:
frame.reindex(columns = states)

### Dropping Entries from an Axis
ðŸŽ¯The drop method is used to drop entries. It will return a new object with theindicated value or values deleted from an axis

In [ ]:
obj = pd.Series(np.arange(5.), index = ['a','b','c','d','e'])

In [ ]:
obj

In [ ]:
new_obj = obj.drop('c')

In [ ]:
new_obj

In [ ]:
obj.drop(['d','c'])

In [ ]:
# With DataFrame, index values can be deleted from either axis
data = pd.DataFrame(np.arange(16).reshape(4,4), index = ['Ohio','Colorado','Utah','New York'], columns = ['one','two','three','four'])

In [ ]:
data

In [ ]:
# Calling drop with a sequence of labels will drop values from the row labels (axis 0)
data.drop(['Colorado','Ohio'])

In [ ]:
data.drop(['Colorado','Ohio'], axis = 0)

In [ ]:
# We acn drop values from columns by passing axis = 1 or axis = 'columns'
data.drop('two', axis = 1)

In [ ]:
data.drop(['two','four'], axis = 'columns')

In [ ]:
# Many functions, like drop, which modify the size or shape of a Series or DataFrame, can manipulate an object in-place without returning a new object
obj.drop('e', inplace = True)

In [81]:
obj

a    0
b    1
c    2
dtype: int64

# Indexing, Selection, and Filtering

In [83]:
# Series ndexing works analogously to NumPy array indexing
obj = pd.Series(np.arange(4.), index = ['a','b','c','d'])

In [85]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [88]:
print(obj['b'])

1.0

In [91]:
obj[['a','c','d']]

a    0.0
c    2.0
d    3.0
dtype: float64

In [94]:
obj[obj > 2]

d    3.0
dtype: float64

In [96]:
# Slicing with labels behaves differently than normal Python slicing in that the end-point is inclusive
obj['b':'c']

b    1.0
c    2.0
dtype: float64

In [98]:
# Setting using these methods modifies the corresponding section of the series
obj['b':'c'] = 5

In [100]:
obj

a    0.0
b    5.0
c    5.0
d    3.0
dtype: float64

In [102]:
# Indexing into a DataFrame is for retrieving one or more columns either with a single value or sequence
data = pd.DataFrame(np.arange(16).reshape(4,4), index = ['Ohio','Colorado','Utah','New York'], columns = ['one','two','three','four'])

In [104]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [162]:
data['one']

Ohio         0
Colorado     0
Utah         8
New York    12
Name: one, dtype: int64

In [173]:
data[['one','three','four']]

          one  three  four
Ohio        0      0     0
Colorado    0      6     7
Utah        8     10    11
New York   12     14    15

In [172]:
# The row selection with slicing
data[:2]

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7

In [114]:
# Indexing with a boolean data
data[data['three'] >5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [117]:
# Indexing with a boolean DataFrame
data < 5

            one    two  three   four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
New York  False  False  False  False

In [122]:
data[data < 5] = 0

In [124]:
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

### Selection with loc and iloc
ðŸŽ¯For DataFrame label-indexing on the rows, introduced special indexing operators loc and iloc. they enable to select a subset of the rows and columns from a DataFrame

In [126]:
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [130]:
data.loc[['Ohio']]

      one  two  three  four
Ohio    0    0      0     0

In [133]:
data.loc[['Colorado','New York']]

          one  two  three  four
Colorado    0    5      6     7
New York   12   13     14    15

In [135]:
data.loc[['New York'], ['one']]

          one
New York   12

In [139]:
data.loc[['Ohio','Colorado','Utah'],['one','three','four']]

          one  three  four
Ohio        0      0     0
Colorado    0      6     7
Utah        8     10    11

In [142]:
data.loc[['Ohio'],['one','three','four']]

      one  three  four
Ohio    0      0     0

In [144]:
data.iloc[0]

one      0
two      0
three    0
four     0
Name: Ohio, dtype: int64

In [146]:
data.iloc[[0]]

      one  two  three  four
Ohio    0    0      0     0

In [148]:
data.iloc[[0,1,2],[1]]

          two
Ohio        0
Colorado    5
Utah        9

In [150]:
data.iloc[[1,2,3],[0,1,2]]

          one  two  three
Colorado    0    5      6
Utah        8    9     10
New York   12   13     14

In [155]:
data.iloc[:,2]

Ohio         0
Colorado     6
Utah        10
New York    14
Name: three, dtype: int64

### Integer Indexs

In [158]:
ser = pd.Series(np.arange(3.))

In [163]:
ser[-1]

KeyError: -1

In [166]:
ser2 = pd.Series(np.arange(3.), index = ['a','b','c'])

In [175]:
print(ser2[-1])

2.0

C:\Users\HP\AppData\Local\Temp\ipykernel_5936\202996544.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  print(ser2[-1])

In [177]:
ser[:1]

0    0.0
dtype: float64

In [179]:
ser.loc[:1]

0    0.0
1    1.0
dtype: float64

In [182]:
ser.iloc[:1]

0    0.0
dtype: float64

### Arithmetic and Data Alignment

In [184]:
s1 = pd.Series([7.3, -2.5, 3.4, 1.5], index = ['a','b','c','d'])

In [186]:
s1

a    7.3
b   -2.5
c    3.4
d    1.5
dtype: float64

In [188]:
s2 = pd.Series([-2.1, 3.6, -1.5, 4, 3.1], index = ['a','c','e','f','g'])

In [190]:
s2

a   -2.1
c    3.6
e   -1.5
f    4.0
g    3.1
dtype: float64

In [192]:
""" The internal data alignment introduces missing values in the label locations that do not overlap. Missing values will
then propagate in further arithmetic computations. """
# Adding these together yields:
s1 + s2

a    5.2
b    NaN
c    7.0
d    NaN
e    NaN
f    NaN
g    NaN
dtype: float64

In [201]:
# In this case of DataFrame, alignment is performed on both the rows and the columns
df2 = pd.DataFrame(np.arange(9.).reshape((3,3)), columns = list('bcd'), index = ['Ohio','Texas','Colorado'])

In [202]:
df3 = pd.DataFrame(np.arange(12.).reshape((4,3)), columns = list('bde'), index = ['Utah','Ohio','Texas','Oregon'])

In [205]:
df2

            b    c    d
Ohio      0.0  1.0  2.0
Texas     3.0  4.0  5.0
Colorado  6.0  7.0  8.0

In [207]:
df3

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [209]:
# Since the 'c' and 'e' columns are not found in both DataFrame objects, they appear as all missing in the result
df2 + df3

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

In [211]:
# If we add DataFrame objects with no column or row labels in common, the result will contain all nulls
df1 = pd.DataFrame({'A':[1,2]})

In [213]:
df2 = pd.DataFrame({'B':[3,4]})

In [215]:
df1

   A
0  1
1  2

In [217]:
df2

   B
0  3
1  4

In [219]:
df1 - df2

    A   B
0 NaN NaN
1 NaN NaN

### Arithmetic Methods with Fill Values

In [221]:
df1 = pd.DataFrame(np.arange(12.).reshape((3,4)), columns = list('abcd'))

In [223]:
df2 = pd.DataFrame(np.arange(20.).reshape((4,5)), columns = list('abcde'))

In [225]:
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [234]:
df2.loc[1,'b'] = np.nan

In [235]:
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   NaN   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [239]:
# Adding these together results in NA values in the locations that do not overlap
df1 + df2

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0   NaN  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [242]:
# Using the add() method on df1, we passed df2 and an argument to fill_value
df1.add(df2, fill_value = 0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0   5.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [244]:
df1.sub(df2, fill_value = 0)

      a     b     c     d     e
0   0.0   0.0   0.0   0.0  -4.0
1  -1.0   5.0  -1.0  -1.0  -9.0
2  -2.0  -2.0  -2.0  -2.0 -14.0
3 -15.0 -16.0 -17.0 -18.0 -19.0

In [249]:
df1.mul(df2, fill_value = 0)

      a     b      c      d    e
0   0.0   1.0    4.0    9.0  0.0
1  20.0   0.0   42.0   56.0  0.0
2  80.0  99.0  120.0  143.0  0.0
3   0.0   0.0    0.0    0.0  0.0

In [251]:
df1.pow(df2, fill_value = 0)

              a              b             c             d    e
0  1.000000e+00            1.0  4.000000e+00  2.700000e+01  0.0
1  1.024000e+03            1.0  2.799360e+05  5.764801e+06  0.0
2  1.073742e+09  31381059609.0  1.000000e+12  3.452271e+13  0.0
3  0.000000e+00            0.0  0.000000e+00  0.000000e+00  0.0

In [257]:
# Relatedly, when reindexing a Series or DataFrame, you can also specify a different fill value
df1.reindex(columns = df2.columns, fill_value = 0)

     a    b     c     d  e
0  0.0  1.0   2.0   3.0  0
1  4.0  5.0   6.0   7.0  0
2  8.0  9.0  10.0  11.0  0

### Operations Between DataFrame and Series

In [269]:
""" As with NumPy arrays of different dimensions, arithmetic between DataFrame and Series is also deined - broadcasting """
arr = np.arange(12.).reshape((3,4))

In [261]:
arr

array([[ 0.,  1.,  2.,  3.],
       [ 4.,  5.,  6.,  7.],
       [ 8.,  9., 10., 11.]])

In [263]:
arr[0]

array([0., 1., 2., 3.])

In [265]:
arr.shape

(3, 4)

In [267]:
arr[0].shape

(4,)

In [270]:
arr - arr[0]

array([[0., 0., 0., 0.],
       [4., 4., 4., 4.],
       [8., 8., 8., 8.]])

In [299]:
# We can do the same with a DataFrame and a Series
frame = pd.DataFrame(np.arange(12.).reshape((4,3)), columns = list('bde'), index = ['Utah','Ohio','Texas','Oregon'])

In [301]:
series = pd.Series(frame.iloc[0])

In [302]:
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [303]:
series

b    0.0
d    1.0
e    2.0
Name: Utah, dtype: float64

frame.shape

In [304]:
series.shape

(3,)

In [306]:
# By default DataFrame and Series matches the index of the Series on the DataFrame's columns, broadcasting down the rows
frame - series

          b    d    e
Utah    0.0  0.0  0.0
Ohio    3.0  3.0  3.0
Texas   6.0  6.0  6.0
Oregon  9.0  9.0  9.0

In [308]:
# If an index value is not found in either the DataFrame's columns or the Series's index, the objects will be reindex to form the union
series2 = pd.Series(range(3), index = ['b','e','f'])

In [310]:
series2

b    0
e    1
f    2
dtype: int64

In [312]:
frame + series2

          b   d     e   f
Utah    0.0 NaN   3.0 NaN
Ohio    3.0 NaN   6.0 NaN
Texas   6.0 NaN   9.0 NaN
Oregon  9.0 NaN  12.0 NaN

In [314]:
# If we want to instead broadcast over the columns, matching on the rows, we have to use one of the arithmetic methods
series3 = frame['d']

In [316]:
series3

Utah       1.0
Ohio       4.0
Texas      7.0
Oregon    10.0
Name: d, dtype: float64

In [320]:
frame.sub(series3, axis = 'index')

          b    d    e
Utah   -1.0  0.0  1.0
Ohio   -1.0  0.0  1.0
Texas  -1.0  0.0  1.0
Oregon -1.0  0.0  1.0